In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])

In [4]:
s#jupyter 是在命令行编程，s在之前运行时已经被记录，包括import 等命令也是

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
s=pd.Series(np.random.randn(5),index=['a','b','c','d','e']) #series 可通过多维数组 矩阵 python对象创建 index指label 如果缺省默认为0~len（s） 支持重复索引

In [6]:
s

a   -0.053058
b   -0.377846
c    0.595743
d   -0.787015
e   -0.838133
dtype: float64

In [7]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
d={'b':1,'c':2,'d':3}
pd.Series(d)

b    1
c    2
d    3
dtype: int64

In [9]:
d_s=pd.Series(d,index=['d','b','c','e']) #字典对应到series 中 key与标签的对应情况
d_s

d    3.0
b    1.0
c    2.0
e    NaN
dtype: float64

In [10]:
d_s[s>s.median()]

c    2.0
dtype: float64

In [11]:
s.array #扩展数组

<PandasArray>
[-0.053057820092326236,  -0.37784576756651705,    0.5957428920980289,
   -0.7870148245144364,   -0.8381334248842772]
Length: 5, dtype: float64

In [12]:
s.to_numpy()

array([-0.05305782, -0.37784577,  0.59574289, -0.78701482, -0.83813342])

In [13]:
d_s.get('e') #通过get 访问没有标签时也不会报错keyerror

nan

In [14]:
s+d_s #计算根据索引自动对齐 索引优先，当索引多时 赋值nan 少时删除没有索引数据

a         NaN
b    0.622154
c    2.595743
d    2.212985
e         NaN
dtype: float64

In [35]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
 'two':pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [16]:
df=pd.DataFrame(d) #标准的series

In [17]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [18]:
pd.DataFrame(d,index=['d','b','a'],columns=['two','three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [19]:
d = {'one': [1., 2., 3., 4.],
'two': [4., 3., 2., 1.]}
pd.DataFrame(d) #数组字典  key值默认为columns

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [20]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2) #字典列表 默认字典内为columns

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [21]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]))#字典字典

   A  B
0  1  4
1  2  5
2  3  6

In [22]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]),orient='index')

   0  1  2
A  1  2  3
B  4  5  6

In [23]:
df['one'] #提取 
df['flag'] = df['one'] > 2 #增加
del df['one'] #删除

In [24]:
df.insert(1, 'one', df['flag']) #insert 在第1列 标签名 one 具体数据是来自df["flag"]
df

   two    one   flag
a  1.0  False  False
b  2.0  False  False
c  3.0   True   True
d  4.0  False  False

In [25]:
# dataframe_name.assign(new_column=exisit_column) 利用已有列产生新的列 返回数据副本

In [26]:
df.loc['b'] #用标签选择行

two         2
one     False
flag    False
Name: b, dtype: object

In [27]:
df.iloc[1] #用行号选择行

two         2
one     False
flag    False
Name: b, dtype: object

In [28]:
df[0:2] #用行切片选择行

   two    one   flag
a  1.0  False  False
b  2.0  False  False

In [29]:
df.T #转置

          a      b     c      d
two       1      2     3      4
one   False  False  True  False
flag  False  False  True  False

In [57]:
df=pd.DataFrame(np.random.randn(3,4), index=[1, 2, 3], columns=['a','b','c','d'])
df

          a         b         c         d
1 -1.267826  0.217740  0.839260 -0.125170
2 -0.064542 -0.467440 -0.564384  0.157178
3 -2.209099 -0.095426 -0.938043 -0.919374

In [31]:
np.exp(df) #可使用log、exp、sqrt等Numpy通用函数

           a          b         c         d
1   1.214757   1.680854  2.185646  5.742434
2  15.122358  11.184802  1.569572  0.969657
3   1.896599   1.812711  1.430687  0.294020

In [32]:
df.a #可以像访问属性一样访问列

1    0.194544
2    2.716174
3    0.640062
Name: a, dtype: float64

In [36]:
##################second day

In [41]:
# 显示头部数据 参数为显示数量 默认为5
df.head(1)
# 显示尾部数据 参数为显示数量 默认为5
df.tail(1)

          a         b         c         d
3 -0.498794  0.507668  1.148364 -0.757037

In [42]:
df.describe()

              a         b         c         d
count  3.000000  3.000000  3.000000  3.000000
mean  -0.114552 -0.188127  0.299764  0.489259
std    0.523333  0.609082  0.734910  1.088573
min   -0.498794 -0.624813 -0.125411 -0.757037
25%   -0.412570 -0.536024 -0.124536  0.106885
50%   -0.326346 -0.447235 -0.123662  0.970807
75%    0.077568  0.030217  0.512351  1.112407
max    0.481482  0.507668  1.148364  1.254007

In [58]:
# 以行列标签访问  建议以 at iat loc iloc 等pandas专有访问，效率更高
df.at[2,'a']

-0.06454168081830189

In [61]:
#以行列号访问  loc iloc 同样支持
df.iat[1,2]

-0.5643839879607152

In [69]:
df=pd.DataFrame({"one":[1,2,3],"two":[4,5,6],"three":[7,8,9]})

In [72]:
df["one"].isin([2]) #根据bool数据返回一个Series，根据bool值可以选择行

0    False
1     True
2    False
Name: one, dtype: bool

In [80]:
d=pd.Series([False,True,False])
df[d]

   one  two  three
1    2    5      8

In [81]:
df.iloc[1,2]=np.nan

In [87]:
df=df.reindex(index=[1,2,3,4],columns=df.columns) #规则仍是对齐标签，源数据中对不齐的就删，没有的标签则补充

In [86]:
#删除所有含缺失值的行 在计算时即使不删除也不会加入计算中
df.dropna(how='any')

   one  two  three
0    1    4    7.0
2    3    6    9.0

In [88]:
df.fillna(value=5) #填充缺失值

   one  two  three
1  2.0  5.0    5.0
2  3.0  6.0    9.0
3  5.0  5.0    5.0
4  5.0  5.0    5.0

In [90]:
pd.isna(df) #判断是否是缺失值

     one    two  three
1  False  False   True
2  False  False  False
3   True   True   True
4   True   True   True

In [92]:
pieces=[df[:1],df[1:2],df[2:]]

In [95]:
pd.concat(pieces) #组合列表内的pandas对象

   one  two  three
1  2.0  5.0    NaN
2  3.0  6.0    9.0
3  NaN  NaN    NaN
4  NaN  NaN    NaN

In [108]:
# 数据库风格连接 根据标签“key”的值进行连接
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [110]:
df

   one  two  three
1  2.0  5.0    NaN
2  3.0  6.0    9.0
3  NaN  NaN    NaN
4  NaN  NaN    NaN

In [111]:
# 追加行
s=pd.Series([1,2,3],index=["one","two","three"])

df.append(s,ignore_index=True)

   one  two  three
0  2.0  5.0    NaN
1  3.0  6.0    9.0
2  NaN  NaN    NaN
3  NaN  NaN    NaN
4  1.0  2.0    3.0

In [114]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
   ....:                          'foo', 'bar', 'foo', 'foo'],
   ....:                    'B': ['one', 'one', 'two', 'three',
   ....:                          'two', 'two', 'one', 'three'],
   ....:                    'C': np.random.randn(8),
   ....:                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.181215  1.350216
1  bar    one  1.078502  1.108971
2  foo    two -0.765834  0.371606
3  bar  three -0.040002  1.838597
4  foo    two  0.528177 -0.116010
5  bar    two  1.546451  0.197833
6  foo    one  0.112451 -0.106470
7  foo  three -1.230372  0.007718

In [115]:
 # 数据根据A列的值进行分组，在同组内进行sum计算
df.groupby("A").sum()

            C         D
A
bar  2.584951  3.145401
foo -0.174363  1.507059

In [117]:
df.groupby(["A","B"]).sum()
# 可多重group

                  C         D
A   B
bar one    1.078502  1.108971
    three -0.040002  1.838597
    two    1.546451  0.197833
foo one    1.293665  1.243745
    three -1.230372  0.007718
    two   -0.237657  0.255596

In [119]:
# df.to_csv
# pd.read_csv
# df.to_excel('foo.xlsx', sheet_name='Sheet1')
# pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])
# 读取写入csv 与excel文件